---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementGeometryResults.Dispose
source: html/4f854679-1b43-1ed6-1bf1-3e6bee12e27e.htm
---
# Autodesk.Revit.DB.SpatialElementGeometryResults.Dispose Method

Releases all resources used by the SpatialElementGeometryResults

## Syntax (C#)
```csharp
public void Dispose()
```